### Terraform plan 
<details><summary>Click to see the plan</summary>


```diff

[command]/home/runner/work/_temp/ad5e6b49-24cb-4831-b410-4ee4952c8777/terraform-bin show -no-color plan.tmp

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.eks.module.eks_managed_node_group["bottlerocket_default"].aws_eks_node_group.this[0] has changed
  ~ resource "aws_eks_node_group" "this" {
        id                     = "aws-eks-cluster:bottlerocket_default-20240505205138063400000014"
      + labels                 = {}
        tags                   = {
            "Name"    = "bottlerocket_default"
            "project" = "aws-eks-cluster"
        }
        # (15 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.eks.aws_eks_access_entry.this["ex-single"] will be created
  + resource "aws_eks_access_entry" "this" {
      + access_entry_arn  = (known after apply)
      + cluster_name      = "aws-eks-cluster"
      + created_at        = (known after apply)
      + id                = (known after apply)
      + kubernetes_groups = [
          + "system:masters",
        ]
      + modified_at       = (known after apply)
      + principal_arn     = "arn:aws:iam::322620855520:user/caio"
      + tags              = {
          + "project" = "aws-eks-cluster"
        }
      + tags_all          = {
          + "project" = "aws-eks-cluster"
        }
      + type              = "STANDARD"
      + user_name         = (known after apply)
    }

  # module.eks.aws_eks_access_policy_association.this["ex-single_single"] will be created
  + resource "aws_eks_access_policy_association" "this" {
      + associated_at = (known after apply)
      + cluster_name  = "aws-eks-cluster"
      + id            = (known after apply)
      + modified_at   = (known after apply)
      + policy_arn    = "arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy"
      + principal_arn = "arn:aws:iam::322620855520:user/caio"

      + access_scope {
          + type = "cluster"
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.
::debug::Terraform exited with code 0.
::debug::stdout: %0ANote: Objects have changed outside of Terraform%0A%0ATerraform detected the following changes made outside of Terraform since the%0Alast "terraform apply" which may have affected this plan:%0A%0A  # module.eks.module.eks_managed_node_group["bottlerocket_default"].aws_eks_node_group.this[0] has changed%0A  ~ resource "aws_eks_node_group" "this" {%0A        id                     = "aws-eks-cluster:bottlerocket_default-20240505205138063400000014"%0A      + labels                 = {}%0A        tags                   = {%0A            "Name"    = "bottlerocket_default"%0A            "project" = "aws-eks-cluster"%0A        }%0A        # (15 unchanged attributes hidden)%0A%0A        # (3 unchanged blocks hidden)%0A    }%0A%0A%0AUnless you have made equivalent changes to your configuration, or ignored the%0Arelevant attributes using ignore_changes, the following plan may include%0Aactions to undo or respond to these changes.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # module.eks.aws_eks_access_entry.this["ex-single"] will be created%0A  + resource "aws_eks_access_entry" "this" {%0A      + access_entry_arn  = (known after apply)%0A      + cluster_name      = "aws-eks-cluster"%0A      + created_at        = (known after apply)%0A      + id                = (known after apply)%0A      + kubernetes_groups = [%0A          + "system:masters",%0A        ]%0A      + modified_at       = (known after apply)%0A      + principal_arn     = "arn:aws:iam::322620855520:user/caio"%0A      + tags              = {%0A          + "project" = "aws-eks-cluster"%0A        }%0A      + tags_all          = {%0A          + "project" = "aws-eks-cluster"%0A        }%0A      + type              = "STANDARD"%0A      + user_name         = (known after apply)%0A    }%0A%0A  # module.eks.aws_eks_access_policy_association.this["ex-single_single"] will be created%0A  + resource "aws_eks_access_policy_association" "this" {%0A      + associated_at = (known after apply)%0A      + cluster_name  = "aws-eks-cluster"%0A      + id            = (known after apply)%0A      + modified_at   = (known after apply)%0A      + policy_arn    = "arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy"%0A      + principal_arn = "arn:aws:iam::322620855520:user/caio"%0A%0A      + access_scope {%0A          + type = "cluster"%0A        }%0A    }%0A%0APlan: 2 to add, 0 to change, 0 to destroy.%0A
::debug::stderr: 
::debug::exitcode: 0
 

```
</details>
